'''Пользователь вводит с клавиатуры число. Необходимо проверить его на четность и нечетность. Если число
четное требуется вывести на экран число и надпись Even
number. Если число нечетное выведите на экран число и
надпись Odd number'''

# num = int(input('Введите число '))
# if num % 2 == 0:
#     print(f'Число {num} четное')
# else:
#     print(f'число {num} нечетное')


'''
Пользователь вводит с клавиатуры число. Необходимо проверить его на кратность 7. Если число кратно
требуется вывести на экран число и надпись Number is
multiple 7. Если число не кратно выведите на экран число
и надпись Number is not multiple 7'''
# num = int(input('Введите число '))
# if num % 7 == 0:
#     print(f'{num} кратно 7')
# else:
#     print(f'{num} не кратно 7')

'''
Пользователь вводит с клавиатуры два числа. Необходимо найти максимум из двух чисел и показать его на
экран
'''
# a = int(input('Введите первое число '))
# b = int(input('Введите второе число '))
# if a > b:
#     print(a)
# else:
#     print(b)

'''
Пользователь вводит с клавиатуры два числа. Необходимо найти минимум из двух чисел и показать его на
экран.
'''
# a = int(input('Введите первое число '))
# b = int(input('Введите второе число '))
# if a < b:
#     print(a)
# else:
#     print(b)


'''
Пользователь вводит с клавиатуры время в секундах, прошедшее с начала дня. В зависимости от выбора
пользователя посчитать, сколько часов, минут и секунд
осталось до полуночи.
'''
# num = int(input('Введите время'))
# # Рассчет времени до полуночи
# seconds = 86400 - num
# hours = seconds // 3600
# seconds -= 3600 * hours
# minutes = seconds // 60
# seconds -= 60 * minutes
# print(hours,'часа', minutes, 'минуты', seconds, 'секунды')

'''
Пользователь вводит с клавиатуры диаметр окружности. В зависимости от выбора пользователя посчитать
площадь или периметр окружности.
'''
# diameter = float(input("Введите диаметр окружности: "))
# calc = input("Введите 'площадь' или 'периметр': ")

# if calc.lower() == "площадь":
#     # radius = diameter / 2
#     # res = 3.14 * radius ** 2
#     res = (diameter ** 2 / 4) * 3.14
#     print("Площадь окружности:", res)

# elif calc.lower() == "периметр":
#     perimeter = 3.14 * diameter
#     print("Периметр окружности:", perimeter)

# else:
#     print("Неверный выбор. Введите 'площадь' или 'периметр'.")


'''
Пользователь вводит с клавиатуры стоимость одной
игровой приставки, их количество и процент скидки.
В зависимости от выбора пользователя посчитать общую
сумму заказа или стоимость одной приставки с учетом
скидки.'''
# ps = float(input('Цена одной приставки '))
# col = int(input('Количество приставок '))
# p = int(input('Процент скидки '))

# ps = ps * col

# dis = (ps / 100) * p

# print(dis)

# if col < 2 and col > 0:
#     print(f'Вы выбрали {col} приставку. Цена с учетом скидки {ps - dis}')
# else:
#     print(f'ВЫ выбрали {col} приставку. Цена с учетом скидки {ps - dis}')

'''
Пользователь вводит с клавиатуры размер файла
в гигабайтах и скорость интернет соеденения в битах в секунду. В зависимости от выбора пользователя посчитать, за сколько часов или минут, или секунд скачается файл.
'''
# Определение переменных
file_size_GB = float(input("Введите размер файла в гигабайтах: "))
internet_speed_bits = float(input("Введите скорость интернет соеденения в битах в секунду: "))

# Конвертирование гигабайт в биты
file_size_bits = file_size_GB * 1024 * 1024 * 1024

# Рассчет времени загрузки файла
time_to_download = file_size_bits / internet_speed_bits

# Определение единицы измерения времени
if time_to_download < 60:
    print(f"Файл скачается за {time_to_download:.2f} секунд.")
elif time_to_download < 3600:
    print(f"Файл скачается за {time_to_download / 60:.2f} минут.")
else:
    print(f"Файл скачается за {time_to_download / 3600:.2f} часов.")